In [5]:
#1 Establish a connection between Python and the Sakila database.

import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass

In [6]:
password = getpass.getpass()

 ········

In [9]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'

engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM rental', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [10]:
#2 Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame.

def rentals_month(engine, month, year):
    query = f"""
    SELECT *
    FROM rental
    WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year};
    """
    df = pd.read_sql(query, con=engine)
    return df

In [20]:

rental_df= rentals_month(engine, month=5, year=2005)
display(rental_df)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

In [21]:
#3 Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

def rental_count_month(rentals_df, month, year):
   
    rental_counts = rentals_df.groupby('customer_id').size().reset_index(name=f'rentals_{month:02d}_{year}')

    return rental_counts

In [27]:
rentals_df1= rental_count_month(rental_df, month=5, year=2005)
display(rentals_df1)

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

In [28]:
rentals_df2= rental_count_month(rental_df, month=6, year=2006)
display(rentals_df2)

     customer_id  rentals_06_2006
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

In [51]:
#4 Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [58]:
def compare_rentals(rentals_df1, rentals_df2):
    
    merged_df = pd.merge(rentals_df1, rentals_df2, on='customer_id', how='outer', suffixes=('_1', '_2'))

    merged_df = merged_df.fillna(0)
   
    count_column_1 = 'rentals_05_2005'
    count_column_2 = 'rentals_06_2006'
   
    merged_df['difference'] = merged_df[count_column_1] - merged_df[count_column_2]

    return merged_df

In [59]:
compare_rentals(rentals_df1, rentals_df2)

     customer_id  rentals_05_2005  rentals_06_2006  difference
0              1                2                2           0
1              2                1                1           0
2              3                2                2           0
3              5                3                3           0
4              6                3                3           0
..           ...              ...              ...         ...
515          594                4                4           0
516          595                1                1           0
517          596                6                6           0
518          597                2                2           0
519          599                1                1           0

[520 rows x 4 columns]